puts "Homebrew - Installing common tools/apps..."

tap "buo/cask-upgrade"    # 'brew cu' (https://github.com/buo/homebrew-cask-upgrade)
tap "homebrew/autoupdate" # (https://github.com/Homebrew/homebrew-autoupdate)

# CLI tools / formulae
brew "bat"        # Cat clone with syntax highlighting and Git integration
brew "bat-extras" # Some bash scripts on top of bat
brew "broot"      # Tree navigation
brew "dust"       # du replacement
brew "fd"         # find replacement
brew "fzf"        # Fuzzy finder
brew "gping"      # Ping with a graph
brew "lsd"        # Rewrite of ls
brew "mcfly"      # Navigate shell history
brew "ripgrep"    # grep replacement
brew "sd"         # sed replacement
brew "tealdeer"   # Simplified man pages on steroids with examples (Rust tldr client)
brew "wget"       # Download utility
brew "xh"         # HTTP client with colorized output (Rust HTTPie)
brew "zoxide"     # cd replacement (frecency-based)

cask_args appdir: "~/Applications"

cask "1password", args: { appdir: "/Applications" }
cask "boop"                      # Tool to perform various text operations
cask "claude"                    # Claude desktop app
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "ghostty"                   # Terminal emulator
cask "keka"                      # Archive utility
cask "obsidian"                  # Notes / knowledge base

puts "===== DEBUG INFO ====="
puts "Current shell is: #{ENV['SHELL']}"
puts "Environment Variables:"
ENV.each { |key, value| puts "#{key}=#{value}" }
puts "===== END DEBUG INFO ====="

homebrewUserEnvironment = ENV["HOMEBREW_USER_ENVIRONMENT"]

if homebrewUserEnvironment.nil? || homebrewUserEnvironment.empty?
	puts "HOMEBREW_USER_ENVIRONMENT is not set. Please set it to 'home' or 'work'."
	exit(1)
else
	puts "HOMEBREW_USER_ENVIRONMENT is set to: #{homebrewUserEnvironment}"
end

if homebrewUserEnvironment.include?("home") && homebrewUserEnvironment.include?("work")
	puts "Error: HOMEBREW_USER_ENVIRONMENT cannot include both 'home' and 'work'."
	exit(1)
end

brewfiles_to_load = []

case homebrewUserEnvironment
when /\bhome\b/
	brewfiles_to_load << File.expand_path("~/.config/homebrew/Brewfile.home")
when /\bwork\b/
	brewfiles_to_load << File.expand_path("~/.config/homebrew/Brewfile.work")
end

if homebrewUserEnvironment.include?("dev")
	brewfiles_to_load << File.expand_path("~/.config/homebrew/Brewfile.dev")
end

brewfiles_to_load.each do |brewfile|
	instance_eval(File.read(brewfile)) if File.exist?(brewfile)
end
